JimKueneman/OpenLcbCLib/src/applications/PlatformIO/ESP32/BasicNode/src/main.cpp

#include <Arduino.h>

#include "stdio.h"
#include "unistd.h"

#include "esp32_drivers.h"
#include "esp32_can_drivers.h"

#include "node_parameters.h"

#include "src/drivers/alias_mappings.h"

#include "src/drivers/common/can_types.h"
#include "src/drivers/common/can_utilities.h"
#include "src/drivers/common/can_buffer_store.h"
#include "src/drivers/common/can_buffer_fifo.h"
#include "src/drivers/common/can_login_message_handler.h"
#include "src/drivers/common/can_login_statemachine.h"
#include "src/drivers/common/can_rx_message_handler.h"
#include "src/drivers/common/can_rx_statemachine.h"
#include "src/drivers/common/can_tx_message_handler.h"
#include "src/drivers/common/can_tx_statemachine.h"
#include "src/drivers/common/can_main_statemachine.h"

#include "src/openlcb/openlcb_application.h"
#include "src/openlcb/openlcb_defines.h"
#include "src/openlcb/openlcb_types.h"
#include "src/openlcb/openlcb_utilities.h"
#include "src/openlcb/openlcb_buffer_store.h"
#include "src/openlcb/openlcb_buffer_list.h"
#include "src/openlcb/openlcb_buffer_fifo.h"
#include "src/openlcb/openlcb_node.h"
#include "src/openlcb/protocol_message_network.h"
#include "src/openlcb/protocol_event_transport.h"
#include "src/openlcb/protocol_snip.h"
#include "src/openlcb/openlcb_main_statemachine.h"
#include "src/openlcb/protocol_datagram_handler.h"
#include "src/openlcb/openlcb_login_statemachine.h"
#include "src/openlcb/openlcb_login_statemachine_handler.h"
#include "src/openlcb/protocol_config_mem_read_handler.h"
#include "src/openlcb/protocol_config_mem_write_handler.h"
#include "src/openlcb/protocol_config_mem_operations_handler.h"

// put function declarations here:

#define LED_BUILTIN 2
#define TEST_PIN 15
#define NODE_ID 0x0501010107DD

void _on_100ms_timer_callback(void)
{
}

static void _on_can_rx_callback(can_msg_t *can_msg)
{
}

static void _on_can_tx_callback(can_msg_t *can_msg)
{
}

static void _alias_change_callback(uint16_t new_alias, node_id_t node_id)
{

  printf("Alias Allocation: 0x%02X  ", new_alias);
  printf("NodeID: 0x%06llX\n\n", node_id);
}

static void _operations_request_factory_reset(openlcb_statemachine_info_t *statemachine_info, config_mem_operations_request_info_t *config_mem_operations_request_info)
{

  printf("Factory Reset: NodeID = 0x%06llX\n", OpenLcbUtilities_extract_node_id_from_openlcb_payload(statemachine_info->incoming_msg_info.msg_ptr, 0));
}

#define TRANSMIT_CAN_FRAME_FUNC &Esp32CanDriver_transmit_raw_can_frame
#define IS_TX_BUFFER_EMPTY_FUNC &Esp32CanDriver_is_can_tx_buffer_clear
#define LOCK_SHARED_RESOURCES_FUNC &Esp32Drivers_lock_shared_resources
#define UNLOCK_SHARED_RESOURCES_FUNC &Esp32Drivers_unlock_shared_resources
#define CONFIG_MEM_READ_FUNC &Esp32Drivers_config_mem_read
#define CONFIG_MEM_WRITE_FUNC Esp32Drivers_config_mem_write
#define OPERATIONS_REBOOT_FUNC &Esp32Drivers_reboot
#define OPERATIONS_FACTORY_RESET_FUNC &_operations_request_factory_reset

const interface_can_login_message_handler_t interface_can_login_message_handler = {

    .alias_mapping_register = &AliasMappings_register,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    // Callback events
    .on_alias_change = &_alias_change_callback

};

const interface_can_login_state_machine_t interface_can_login_state_machine = {

    .state_init = &CanLoginMessageHandler_state_init,
    .state_generate_seed = &CanLoginMessageHandler_state_generate_seed,
    .state_generate_alias = &CanLoginMessageHandler_state_generate_alias,
    .state_load_cid07 = &CanLoginMessageHandler_state_load_cid07,
    .state_load_cid06 = &CanLoginMessageHandler_state_load_cid06,
    .state_load_cid05 = &CanLoginMessageHandler_state_load_cid05,
    .state_load_cid04 = &CanLoginMessageHandler_state_load_cid04,
    .state_wait_200ms = &CanLoginMessageHandler_state_wait_200ms,
    .state_load_rid = &CanLoginMessageHandler_state_load_rid,
    .state_load_amd = &CanLoginMessageHandler_state_load_amd

};

const interface_can_rx_message_handler_t interface_can_rx_message_handler = {

    .can_buffer_store_allocate_buffer = &CanBufferStore_allocate_buffer,
    .openlcb_buffer_store_allocate_buffer = &OpenLcbBufferStore_allocate_buffer,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    .alias_mapping_find_mapping_by_node_id = &AliasMappings_find_mapping_by_node_id,
    .alias_mapping_get_alias_mapping_info = &AliasMappings_get_alias_mapping_info,
    .alias_mapping_set_has_duplicate_alias_flag = &AliasMappings_set_has_duplicate_alias_flag

};

const interface_can_rx_statemachine_t interface_can_rx_statemachine = {

    .handle_can_legacy_snip = &CanRxMessageHandler_can_legacy_snip,
    .handle_single_frame = &CanRxMessageHandler_single_frame,
    .handle_first_frame = &CanRxMessageHandler_first_frame,
    .handle_middle_frame = &CanRxMessageHandler_middle_frame,
    .handle_last_frame = &CanRxMessageHandler_last_frame,
    .handle_stream_frame = &CanRxMessageHandler_stream_frame,
    .handle_rid_frame = CanRxMessageHandler_rid_frame,
    .handle_amd_frame = CanRxMessageHandler_amd_frame,
    .handle_ame_frame = CanRxMessageHandler_ame_frame,
    .handle_amr_frame = CanRxMessageHandler_amr_frame,
    .handle_error_info_report_frame = CanRxMessageHandler_error_info_report_frame,
    .handle_cid_frame = CanRxMessageHandler_cid_frame,
    .alias_mapping_find_mapping_by_alias = &AliasMappings_find_mapping_by_alias,
    // Callback events
    .on_receive = &_on_can_rx_callback

};

const interface_can_tx_message_handler_t interface_can_tx_message_handler = {

    .transmit_can_frame = TRANSMIT_CAN_FRAME_FUNC, //  HARDWARE INTERFACE
    // Callback events
    .on_transmit = &_on_can_tx_callback

};

const interface_can_tx_statemachine_t interface_can_tx_statemachine = {

    .is_tx_buffer_empty = IS_TX_BUFFER_EMPTY_FUNC, //  HARDWARE INTERFACE
    .handle_addressed_msg_frame = &CanTxMessageHandler_addressed_msg_frame,
    .handle_unaddressed_msg_frame = &CanTxMessageHandler_unaddressed_msg_frame,
    .handle_datagram_frame = &CanTxMessageHandler_datagram_frame,
    .handle_stream_frame = &CanTxMessageHandler_stream_frame,
    .handle_can_frame = &CanTxMessageHandler_can_frame

