JimKueneman/OpenLcbCLib/src/applications/PlatformIO/ESP32/BasicNode/src/main.cpp
};

const interface_can_main_statemachine_t interface_can_main_statemachine = {

    .lock_shared_resources = LOCK_SHARED_RESOURCES_FUNC,     //  HARDWARE INTERFACE
    .unlock_shared_resources = UNLOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE
    .send_can_message = &CanTxStatemachine_send_can_message,
    .openlcb_node_get_first = &OpenLcbNode_get_first,
    .openlcb_node_get_next = &OpenLcbNode_get_next,
    .openlcb_node_find_by_alias = &OpenLcbNode_find_by_alias,
    .login_statemachine_run = &CanLoginStateMachine_run,
    .alias_mapping_get_alias_mapping_info = &AliasMappings_get_alias_mapping_info,
    .alias_mapping_unregister = &AliasMappings_unregister,

    .handle_duplicate_aliases = &CanMainStatemachine_handle_duplicate_aliases,
    .handle_outgoing_can_message = &CanMainStatemachine_handle_outgoing_can_message,
    .handle_login_outgoing_can_message = &CanMainStatemachine_handle_login_outgoing_can_message,
    .handle_try_enumerate_first_node = &CanMainStatemachine_handle_try_enumerate_first_node,
    .handle_try_enumerate_next_node = &CanMainStatemachine_handle_try_enumerate_next_node

};

const interface_openlcb_node_t interface_openlcb_node = {

    // Callback events
    .on_100ms_timer_tick = &_on_100ms_timer_callback

};

const interface_openlcb_protocol_message_network_t interface_openlcb_protocol_message_network = {

};

const interface_openlcb_protocol_event_transport_t interface_openlcb_protocol_event_transport = {

    // Callback events
    .on_consumer_range_identified = NULL,
    .on_consumer_identified_unknown = NULL,
    .on_consumer_identified_set = NULL,
    .on_consumer_identified_clear = NULL,
    .on_consumer_identified_reserved = NULL,
    .on_producer_range_identified = NULL,
    .on_producer_identified_unknown = NULL,
    .on_producer_identified_set = NULL,
    .on_producer_identified_clear = NULL,
    .on_producer_identified_reserved = NULL,
    .on_event_learn = NULL,
    .on_pc_event_report = NULL,
    .on_pc_event_report_with_payload = NULL

};

const interface_openlcb_login_message_handler_t interface_openlcb_login_message_handler = {

    .extract_producer_event_state_mti = &ProtocolEventTransport_extract_producer_event_status_mti,
    .extract_consumer_event_state_mti = &ProtocolEventTransport_extract_consumer_event_status_mti

};

const interface_openlcb_login_state_machine_t interface_openlcb_login_state_machine = {

    .load_initialization_complete = &OpenLcbLoginMessageHandler_load_initialization_complete,
    .load_producer_events = &OpenLcbLoginMessageHandler_load_producer_event,
    .load_consumer_events = &OpenLcbLoginMessageHandler_load_consumer_event,

    .send_openlcb_msg = &CanTxStatemachine_send_openlcb_message,
    .openlcb_node_get_first = &OpenLcbNode_get_first,
    .openlcb_node_get_next = &OpenLcbNode_get_next,

    .process_login_statemachine = &OpenLcbLoginStateMachine_process,
    .handle_outgoing_openlcb_message = &OpenLcbLoginStatemachine_handle_outgoing_openlcb_message,
    .handle_try_reenumerate = &OpenLcbLoginStatemachine_handle_try_reenumerate,
    .handle_try_enumerate_first_node = &OpenLcbLoginStatemachine_handle_try_enumerate_first_node,
    .handle_try_enumerate_next_node = &OpenLcbLoginStatemachine_handle_try_enumerate_next_node};

const interface_openlcb_main_statemachine_t interface_openlcb_main_statemachine = {

    // ************************************************************************
    // Required message handlers
    // ************************************************************************

    // MESSAGE NETWORK
    .message_network_initialization_complete = ProtocolMessageNetwork_handle_initialization_complete,
    .message_network_initialization_complete_simple = ProtocolMessageNetwork_handle_initialization_complete_simple,
    .message_network_verify_node_id_addressed = &ProtocolMessageNetwork_handle_verify_node_id_addressed,
    .message_network_verify_node_id_global = &ProtocolMessageNetwork_handle_verify_node_id_global,
    .message_network_verified_node_id = &ProtocolMessageNetwork_handle_verified_node_id,
    .message_network_optional_interaction_rejected = &ProtocolMessageNetwork_handle_optional_interaction_rejected,
    .message_network_terminate_due_to_error = &ProtocolMessageNetwork_handle_terminate_due_to_error,

    // PROTOCOL SUPPORT
    .message_network_protocol_support_inquiry = &ProtocolMessageNetwork_handle_protocol_support_inquiry,
    .message_network_protocol_support_reply = &ProtocolMessageNetwork_handle_protocol_support_reply,

    // General
    .lock_shared_resources = LOCK_SHARED_RESOURCES_FUNC,     //  HARDWARE INTERFACE
    .unlock_shared_resources = UNLOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE
    .send_openlcb_msg = &CanTxStatemachine_send_openlcb_message,
    .openlcb_node_get_first = &OpenLcbNode_get_first,
    .openlcb_node_get_next = &OpenLcbNode_get_next,
    .load_interaction_rejected = &OpenLcbMainStatemachine_load_interaction_rejected,

    // Test injection
    .process_main_statemachine = OpenLcbMainStatemachine_process_main_statemachine,
    .does_node_process_msg = &OpenLcbMainStatemachine_does_node_process_msg,
    .handle_outgoing_openlcb_message = &OpenLcbMainStatemachine_handle_outgoing_openlcb_message,
    .handle_try_reenumerate = &OpenLcbMainStatemachine_handle_try_reenumerate,
    .handle_try_pop_next_incoming_openlcb_message = &OpenLcbMainStatemachine_handle_try_pop_next_incoming_openlcb_message,
    .handle_try_enumerate_first_node = &OpenLcbMainStatemachine_handle_try_enumerate_first_node,
    .handle_try_enumerate_next_node = &OpenLcbMainStatemachine_handle_try_enumerate_next_node,

    // ************************************************************************
    // Optional message handlers
    // ************************************************************************

    // SNIP
    .snip_simple_node_info_request = &ProtocolSnip_handle_simple_node_info_request,
    .snip_simple_node_info_reply = &ProtocolSnip_handle_simple_node_info_reply,

    // EVENTS
    .event_transport_consumer_identify = &ProtocolEventTransport_handle_consumer_identify,
    .event_transport_consumer_range_identified = &ProtocolEventTransport_handle_consumer_range_identified,
    .event_transport_consumer_identified_unknown = &ProtocolEventTransport_handle_consumer_identified_unknown,
    .event_transport_consumer_identified_set = &ProtocolEventTransport_handle_consumer_identified_set,
    .event_transport_consumer_identified_clear = &ProtocolEventTransport_handle_consumer_identified_clear,
    .event_transport_consumer_identified_reserved = &ProtocolEventTransport_handle_consumer_identified_reserved,
    .event_transport_producer_identify = &ProtocolEventTransport_handle_producer_identify,
    .event_transport_producer_range_identified = &ProtocolEventTransport_handle_producer_range_identified,
    .event_transport_producer_identified_unknown = &ProtocolEventTransport_handle_producer_identified_unknown,
    .event_transport_producer_identified_set = &ProtocolEventTransport_handle_producer_identified_set,
    .event_transport_producer_identified_clear = &ProtocolEventTransport_handle_producer_identified_clear,
    .event_transport_producer_identified_reserved = &ProtocolEventTransport_handle_producer_identified_reserved,
    .event_transport_identify_dest = &ProtocolEventTransport_handle_events_identify_dest,
    .event_transport_identify = &ProtocolEventTransport_handle_events_identify,
    .event_transport_learn = &ProtocolEventTransport_handle_event_learn,
    .event_transport_pc_report = &ProtocolEventTransport_handle_pc_event_report,
    .event_transport_pc_report_with_payload = &ProtocolEventTransport_handle_pc_event_report_with_payload,

    // TRACTION
    .traction_control_command = NULL,
    .traction_control_reply = NULL,

    // TRACTION SNIP
    .simple_train_node_ident_info_request = NULL,
    .simple_train_node_ident_info_reply = NULL,

    // DATAGRAM
    .datagram = ProtocolDatagramHandler_datagram,
    .datagram_ok_reply = ProtocolDatagramHandler_datagram_received_ok,
    .datagram_rejected_reply = ProtocolDatagramHandler_datagram_rejected,

    // STREAM
    .stream_initiate_request = NULL,
    .stream_initiate_reply = NULL,
    .stream_send_data = NULL,
    .stream_data_proceed = NULL,
    .stream_data_complete = NULL};

const interface_openlcb_protocol_snip_t interface_openlcb_protocol_snip = {

