JimKueneman/OpenLcbCLib/src/applications/PlatformIO/ESP32/BasicNode/src/main.cpp
    .configuration_memory_read = CONFIG_MEM_READ_FUNC,
    .configuration_memory_write = CONFIG_MEM_WRITE_FUNC

};

const interface_protocol_config_mem_read_handler_t interface_protocol_config_mem_read_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message,
    .config_memory_read = CONFIG_MEM_READ_FUNC,

    .snip_load_manufacturer_version_id = &ProtocolSnip_load_manufacturer_version_id,
    .snip_load_name = &ProtocolSnip_load_name,
    .snip_load_model = &ProtocolSnip_load_model,
    .snip_load_hardware_version = &ProtocolSnip_load_hardware_version,
    .snip_load_software_version = &ProtocolSnip_load_software_version,
    .snip_load_user_version_id = &ProtocolSnip_load_user_version_id,
    .snip_load_user_name = &ProtocolSnip_load_user_name,
    .snip_load_user_description = &ProtocolSnip_load_user_description,

    .read_request_config_definition_info = &ProtocolConfigMemReadHandler_read_request_config_definition_info,
    .read_request_all = NULL,
    .read_request_config_mem = &ProtocolConfigMemReadHandler_read_request_config_mem,
    .read_request_acdi_manufacturer = &ProtocolConfigMemReadHandler_read_request_acdi_manufacturer,
    .read_request_acdi_user = &ProtocolConfigMemReadHandler_read_request_acdi_user,
    .read_request_traction_function_config_definition_info = NULL,
    .read_request_traction_function_config_memory = NULL,

    .delayed_reply_time = NULL

};

const interface_protocol_config_mem_write_handler_t interface_protocol_config_mem_write_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message,
    .config_memory_write = CONFIG_MEM_WRITE_FUNC,
    .snip_user_name_write = &ProtocolSnip_write_user_name,
    .snip_user_description_write = ProtocolSnip_write_user_description,

    .write_request_config_definition_info = NULL,
    .write_request_all = NULL,
    .write_request_config_mem = &ProtocolConfigMemWriteHandler_write_request_config_mem,
    .write_request_acdi_manufacturer = NULL,
    .write_request_acdi_user = &ProtocolConfigMemWriteHandler_write_request_acdi_user,
    .write_request_traction_function_config_definition_info = NULL,
    .write_request_traction_function_config_memory = NULL,

    .delayed_reply_time = NULL

};

const interface_protocol_config_mem_operations_handler_t interface_protocol_config_mem_operations_handler = {

    .load_datagram_received_ok_message = &ProtocolDatagramHandler_load_datagram_received_ok_message,
    .load_datagram_received_rejected_message = &ProtocolDatagramHandler_load_datagram_rejected_message,

    .operations_request_options_cmd = &ProtocolConfigMemOperationsHandler_request_options_cmd,
    .operations_request_options_cmd_reply = NULL,
    .operations_request_get_address_space_info = ProtocolConfigMemOperationsHandler_request_get_address_space_info,
    .operations_request_get_address_space_info_reply_present = NULL,
    .operations_request_get_address_space_info_reply_not_present = NULL,
    .operations_request_reserve_lock = ProtocolConfigMemOperationsHandler_request_reserve_lock,
    .operations_request_reserve_lock_reply = NULL,
    .operations_request_get_unique_id = NULL,
    .operations_request_get_unique_id_reply = NULL,
    .operations_request_freeze = NULL,
    .operations_request_unfreeze = NULL,
    .operations_request_update_complete = NULL,
    .operations_request_reset_reboot = OPERATIONS_REBOOT_FUNC,        // HARDWARE INTERFACE
    .operations_request_factory_reset = OPERATIONS_FACTORY_RESET_FUNC // HARDWARE INTERFACE

};

const interface_openlcb_application_t interface_openlcb_application = {

    .send_openlcb_msg = &CanTxStatemachine_send_openlcb_message,
    .configuration_memory_read = CONFIG_MEM_READ_FUNC,
    .configuration_memory_write = CONFIG_MEM_WRITE_FUNC

};

const interface_protocol_datagram_handler_t interface_protocol_datagram_handler = {

    // Config Memory Read
    .memory_read_space_config_description_info = &ProtocolConfigMemReadHandler_read_space_config_description_info,
    .memory_read_space_all = &ProtocolConfigMemReadHandler_read_space_all,
    .memory_read_space_configuration_memory = &ProtocolConfigMemReadHandler_read_space_config_memory,
    .memory_read_space_acdi_manufacturer = &ProtocolConfigMemReadHandler_read_space_acdi_manufacturer,
    .memory_read_space_acdi_user = &ProtocolConfigMemReadHandler_read_space_acdi_user,
    .memory_read_space_traction_function_definition_info = &ProtocolConfigMemReadHandler_read_space_traction_function_definition_info,
    .memory_read_space_traction_function_config_memory = &ProtocolConfigMemReadHandler_read_space_traction_function_config_memory,

    // Config Memory Read Reply Ok
    .memory_read_space_config_description_info_reply_ok = NULL,
    .memory_read_space_all_reply_ok = NULL,
    .memory_read_space_configuration_memory_reply_ok = NULL,
    .memory_read_space_acdi_manufacturer_reply_ok = NULL,
    .memory_read_space_acdi_user_reply_ok = NULL,
    .memory_read_space_traction_function_definition_info_reply_ok = NULL,
    .memory_read_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Read Reply Failed
    .memory_read_space_config_description_info_reply_fail = NULL,
    .memory_read_space_all_reply_fail = NULL,
    .memory_read_space_configuration_memory_reply_fail = NULL,
    .memory_read_space_acdi_manufacturer_reply_fail = NULL,
    .memory_read_space_acdi_user_reply_fail = NULL,
    .memory_read_space_traction_function_definition_info_reply_fail = NULL,
    .memory_read_space_traction_function_config_memory_reply_fail = NULL,

    // Config Memory Stream Read
    .memory_read_stream_space_config_description_info = NULL,
    .memory_read_stream_space_all = NULL,
    .memory_read_stream_space_configuration_memory = NULL,
    .memory_read_stream_space_acdi_manufacturer = NULL,
    .memory_read_stream_space_acdi_user = NULL,
    .memory_read_stream_space_traction_function_definition_info = NULL,
    .memory_read_stream_space_traction_function_config_memory = NULL,

    // Config Memory Stream Read Reply = Ok
    .memory_read_stream_space_config_description_info_reply_ok = NULL,
    .memory_read_stream_space_all_reply_ok = NULL,
    .memory_read_stream_space_configuration_memory_reply_ok = NULL,
    .memory_read_stream_space_acdi_manufacturer_reply_ok = NULL,
    .memory_read_stream_space_acdi_user_reply_ok = NULL,
    .memory_read_stream_space_traction_function_definition_info_reply_ok = NULL,
    .memory_read_stream_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Stream Read Reply = Failed
    .memory_read_stream_space_config_description_info_reply_fail = NULL,
    .memory_read_stream_space_all_reply_fail = NULL,
    .memory_read_stream_space_configuration_memory_reply_fail = NULL,
    .memory_read_stream_space_acdi_manufacturer_reply_fail = NULL,
    .memory_read_stream_space_acdi_user_reply_fail = NULL,
    .memory_read_stream_space_traction_function_definition_info_reply_fail = NULL,
    .memory_read_stream_space_traction_function_config_memory_reply_fail = NULL,

