JimKueneman/OpenLcbCLib/src/applications/PlatformIO/ESP32/BasicNode/src/main.cpp
    // Config Memory Write
    .memory_write_space_config_description_info = NULL,
    .memory_write_space_all = NULL,
    .memory_write_space_configuration_memory = NULL,
    .memory_write_space_acdi_manufacturer = NULL,
    .memory_write_space_acdi_user = NULL,
    .memory_write_space_traction_function_definition_info = NULL,
    .memory_write_space_traction_function_config_memory = NULL,
    .memory_write_space_firmware_upgrade = NULL,

    // Config Memory Write Reply Ok
    .memory_write_space_config_description_info_reply_ok = NULL,
    .memory_write_space_all_reply_ok = NULL,
    .memory_write_space_configuration_memory_reply_ok = NULL,
    .memory_write_space_acdi_manufacturer_reply_ok = NULL,
    .memory_write_space_acdi_user_reply_ok = NULL,
    .memory_write_space_traction_function_definition_info_reply_ok = NULL,
    .memory_write_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Write Reply Fail
    .memory_write_space_config_description_info_reply_fail = NULL,
    .memory_write_space_all_reply_fail = NULL,
    .memory_write_space_configuration_memory_reply_fail = NULL,
    .memory_write_space_acdi_manufacturer_reply_fail = NULL,
    .memory_write_space_acdi_user_reply_fail = NULL,
    .memory_write_space_traction_function_definition_info_reply_fail = NULL,
    .memory_write_space_traction_function_config_memory_reply_fail = NULL,

    // Config Memory Write Under Mask
    .memory_write_under_mask_space_config_description_info = NULL,
    .memory_write_under_mask_space_all = NULL,
    .memory_write_under_mask_space_configuration_memory = NULL,
    .memory_write_under_mask_space_acdi_manufacturer = NULL,
    .memory_write_under_mask_space_acdi_user = NULL,
    .memory_write_under_mask_space_traction_function_definition_info = NULL,
    .memory_write_under_mask_space_traction_function_config_memory = NULL,
    .memory_write_under_mask_space_firmware_upgrade = NULL,

    // Config Memory Stream Write
    .memory_write_stream_space_config_description_info = NULL,
    .memory_write_stream_space_all = NULL,
    .memory_write_stream_space_configuration_memory = NULL,
    .memory_write_stream_space_acdi_manufacturer = NULL,
    .memory_write_stream_space_acdi_user = NULL,
    .memory_write_stream_space_traction_function_definition_info = NULL,
    .memory_write_stream_space_traction_function_config_memory = NULL,
    .memory_write_stream_space_firmware_upgrade = NULL,

    // Config Memory Stream Write Reply = Ok
    .memory_write_stream_space_config_description_info_reply_ok = NULL,
    .memory_write_stream_space_all_reply_ok = NULL,
    .memory_write_stream_space_configuration_memory_reply_ok = NULL,
    .memory_write_stream_space_acdi_manufacturer_reply_ok = NULL,
    .memory_write_stream_space_acdi_user_reply_ok = NULL,
    .memory_write_stream_space_traction_function_definition_info_reply_ok = NULL,
    .memory_write_stream_space_traction_function_config_memory_reply_ok = NULL,

    // Config Memory Stream Write Reply = Failed
    .memory_write_stream_space_config_description_info_reply_fail = NULL,
    .memory_write_stream_space_all_reply_fail = NULL,
    .memory_write_stream_space_configuration_memory_reply_fail = NULL,
    .memory_write_stream_space_acdi_manufacturer_reply_fail = NULL,
    .memory_write_stream_space_acdi_user_reply_fail = NULL,
    .memory_write_stream_space_traction_function_definition_info_reply_fail = NULL,
    .memory_write_stream_space_traction_function_config_memory_reply_fail = NULL,

    // Config Memory Commands
    .memory_options_cmd = &ProtocolConfigMemOperationsHandler_options_cmd,
    .memory_options_reply = &ProtocolConfigMemOperationsHandler_options_reply,
    .memory_get_address_space_info = &ProtocolConfigMemOperationsHandler_get_address_space_info,
    .memory_get_address_space_info_reply_not_present = &ProtocolConfigMemOperationsHandler_get_address_space_info_reply_not_present,
    .memory_get_address_space_info_reply_present = &ProtocolConfigMemOperationsHandler_get_address_space_info_reply_present,
    .memory_reserve_lock = &ProtocolConfigMemOperationsHandler_reserve_lock,
    .memory_reserve_lock_reply = &ProtocolConfigMemOperationsHandler_reserve_lock_reply,
    .memory_get_unique_id = ProtocolConfigMemOperationsHandler_get_unique_id,
    .memory_get_unique_id_reply = &ProtocolConfigMemOperationsHandler_get_unique_id_reply,
    .memory_unfreeze = &ProtocolConfigMemOperationsHandler_unfreeze,
    .memory_freeze = &ProtocolConfigMemOperationsHandler_freeze,
    .memory_update_complete = &ProtocolConfigMemOperationsHandler_update_complete,
    .memory_reset_reboot = &ProtocolConfigMemOperationsHandler_reset_reboot,
    .memory_factory_reset = &ProtocolConfigMemOperationsHandler_factory_reset,

    .lock_shared_resources = LOCK_SHARED_RESOURCES_FUNC,     //  HARDWARE INTERFACE
    .unlock_shared_resources = UNLOCK_SHARED_RESOURCES_FUNC, //  HARDWARE INTERFACE

};

void setup()
{
  pinMode(TEST_PIN, OUTPUT);
  pinMode(LED_BUILTIN, OUTPUT);

  Serial.begin(9600);

  Serial.println("Can Statemachine init.....");
  Esp32CanDriver_setup();
  Esp32Drivers_setup();

  CanBufferStore_initialize();
  CanBufferFifo_initialize();

  CanRxMessageHandler_initialize(&interface_can_rx_message_handler);
  CanRxStatemachine_initialize(&interface_can_rx_statemachine);

  CanTxMessageHandler_initialize(&interface_can_tx_message_handler);
  CanTxStatemachine_initialize(&interface_can_tx_statemachine);

  CanLoginMessageHandler_initialize(&interface_can_login_message_handler);
  CanLoginStateMachine_initialize(&interface_can_login_state_machine);
  CanMainStatemachine_initialize(&interface_can_main_statemachine);

  AliasMappings_initialize();

  OpenLcbBufferStore_initialize();
  OpenLcbBufferList_initialize();
  OpenLcbBufferFifo_initialize();

  ProtocolSnip_initialize(&interface_openlcb_protocol_snip);
  ProtocolDatagramHandler_initialize(&interface_protocol_datagram_handler);
  ProtocolEventTransport_initialize(&interface_openlcb_protocol_event_transport);
  ProtocolMessageNetwork_initialize(&interface_openlcb_protocol_message_network);
  ProtocolConfigMemReadHandler_initialize(&interface_protocol_config_mem_read_handler);
  ProtocolConfigMemWriteHandler_initialize(&interface_protocol_config_mem_write_handler);
  ProtocolConfigMemOperationsHandler_initialize(&interface_protocol_config_mem_operations_handler);

  OpenLcbNode_initialize(&interface_openlcb_node);

  OpenLcbLoginMessageHandler_initialize(&interface_openlcb_login_message_handler);
  OpenLcbLoginStateMachine_initialize(&interface_openlcb_login_state_machine);
  OpenLcbMainStatemachine_initialize(&interface_openlcb_main_statemachine);

  OpenLcbApplication_initialize(&interface_openlcb_application);

  Serial.println("Creating Node.....");

  OpenLcbNode_allocate(NODE_ID, &NodeParameters_main_node);
}

void test()
{
}

void loop()
{

  CanMainStateMachine_run();
  OpenLcbLoginMainStatemachine_run();
  OpenLcbMainStatemachine_run();
}
